CSI API ETABS v1

# cLoadCasesGetTypeOAPI Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetTypeOAPI(
    	string Name,
    	ref eLoadCaseType CaseType,
    	ref int SubType
    )

    Function GetTypeOAPI (
    	Name As String,
    	ByRef CaseType As eLoadCaseType,
    	ByRef SubType As Integer
    ) As Integer

    Dim instance As cLoadCases
    Dim Name As String
    Dim CaseType As eLoadCaseType
    Dim SubType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetTypeOAPI(Name,
    	CaseType, SubType)

    int GetTypeOAPI(
    	String^ Name,
    	eLoadCaseType% CaseType,
    	int% SubType
    )

    abstract GetTypeOAPI :
            Name : string *
            CaseType : eLoadCaseType byref *
            SubType : int byref -> int

#### Parameters

Name

    Type: SystemString

CaseType

    Type: ETABSv1eLoadCaseType

SubType

    Type: SystemInt32

#### Return Value

Type: Int32

Remarks

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com